#!/usr/bin/env python
# -*- coding: utf-8 -*-
"""
    @Author：吉姆哥儿
    @file： YjsInputHidKeyCode.py
    @date：2023/10/15 1:22
    @desc: 
"""

yjsInputHidKeyCode = {
    "1": 30,

    "2": 31,

    "3": 32,

    "4": 33,

    "5": 34,

    "6": 35,

    "7": 36,

    "8": 37,

    "9": 38,

    "0": 39,

    "-": 45,

    "=": 46,

    "backspace": 42,

    "a": 4,

    "b": 5,

    "c": 6,

    "d": 7,

    "e": 8,

    "f": 9,

    "g": 10,

    "h": 11,

    "i": 12,

    "j": 13,

    "k": 14,

    "l": 15,

    "m": 16,

    "n": 17,

    "o": 18,

    "p": 19,

    "q": 20,

    "r": 21,

    "s": 22,

    "t": 23,

    "u": 24,

    "v": 25,

    "w": 26,

    "x": 27,

    "y": 28,

    "z": 29,

    "leftctrl": 224,

    "leftalt": 226,

    "leftshift": 225,

    "leftwin": 227,

    "space": 44,

    "capslock": 57,

    "tab": 43,

    "~": 53,

    "esc": 41,

    "enter": 40,

    "up": 82,

    "down": 81,

    "left": 80,

    "right": 39,

    "option": 79,

    "printscreen": 70,

    "delete": 76,

    "home": 74,

    "end": 77,

    "pageup": 75
    ,
    "pagedown": 78,

    "f1": 58,

    "f2": 59,

    "f3": 60,

    "f4": 61,

    "f5": 62,

    "f6": 63,

    "f7": 64,

    "f8": 65,

    "f9": 66,

    "f10": 67,

    "f11": 68,

    "f12": 69,

    "[": 47,

    "]": 48,

    "\\": 49,

    ";": 51,

    "'": 52,

    ",": 54,

    ".": 55,

    "/": 56,

}

